# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки.

import random
bush_number = int(input("Введите количество кустов: "))
berry_number = list()

for i in range(0,bush_number):
    n = random.randint(1,100)
    berry_number.append(n)

berry_picker = list()
for i in range(len(berry_number)):
       berry_picker.append(berry_number[i-2] + berry_number[i-1] + berry_number[i])

print(f"Максимальное число ягод, собранное за один проход: {max(berry_picker)}")